org/new/GMarin_CV.tex
% Created 2024-06-23 Sun 15:29
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\pagenumbering{gobble}
\usepackage[defaultsans]{opensans}
\usepackage[T1]{fontenc}
\usepackage[big]{layaureo} %better A4 formating
\usepackage{titlesec} %custom \section
\usepackage{url,parskip} %packages for formating
\usepackage{multicol} % multiples columns
\usepackage{ragged2e} % for alignment
\usepackage{color}
\usepackage{graphicx}
\usepackage{svg}
\usepackage{hyperref}
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks,urlcolor=linkcolour, linkcolor=linkcolour}
\titleformat{\section}{\Huge\scshape\raggedright}{}{0em}{}[\titlerule]
\titlespacing{\section}{0pt}{4pt}{4pt}
\setlength{\columnsep}{1cm} % space between columns
\titleformat{\subsection}{\large\scshape\raggedright}{}{0em}{}[\titlerule]
\titlespacing{\subsection}{0pt}{4pt}{4pt}
\setlength{\columnsep}{1cm} % space between columns
\date{}
\title{}
\hypersetup{
 pdfauthor={DESKTOP-8LGKRKH},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\section*{\textbf{Gabriel Marin}}
\label{sec:orgd521007}
\begin{center}
\begin{tabular}{{p{2.5cm}p{13cm}}}
Email: & \href{mailto:marin.gabriel@protonmail.com}{marin.gabriel@protonmail.com}\\[0pt]
Linkedin: & \href{https://linkedin.com/in/gbrlmarn}{linkedin.com/in/gbrlmarn}\\[0pt]
Github: & \href{https://github.com/gbrlmarn}{github.com/gbrlmarn}\\[0pt]
Site: & \href{https://gbrlmarn.github.io}{gbrlmarn.github.io}\\[0pt]
\end{tabular}
\end{center}
\subsection*{About me}
\label{sec:org064d57e}
I'm a \textbf{software engineer} with a background in networking 
and programming, passionate about programming languages,
open source software and operating systems.
\subsection*{Employment}
\label{sec:orgf93156f}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2022-Present & \textbf{Software Engineer} at Luxoft, Bucharest\\[0pt]
 & Maintained project building environment using CMake.\\[0pt]
 & Done socket programming using ZeroMQ library in C/C++.\\[0pt]
 & Automated environment configuration using Docker and Bash.\\[0pt]
 & Created integration tests using Golang and Clojure.\\[0pt]
 & Developed command line interface for sending/receiving messages.\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2021-2022 & \textbf{Software Engineer} at Continental, Sibiu\\[0pt]
 & Worked on code generator, parsing XML and Json with Java and Python.\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2019-2021 & \textbf{System Engineer} at Ministry of Internal Affairs, Rm.Valcea\\[0pt]
 & Developed scripts for task automation with PowerShell.\\[0pt]
 & Deployed and configured Radius server and Squid proxy.\\[0pt]
2018-2019 & \textbf{Middleware Engineer} at Ministry of Internal Affairs, Bucharest\\[0pt]
 & Provided layer 1 support.\\[0pt]
 & Managed users access in Oracle SQL database.\\[0pt]
\end{tabular}
\end{center}
\subsection*{Education}
\label{sec:org4525740}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
2018-2020 & \textbf{Master's in Telecommunications Engineering} at\\[0pt]
 & \emph{Military Technical Academy}, Bucharest\\[0pt]
2014-2018 & \textbf{Bachelor's in Telecommunications Engineering} at\\[0pt]
 & \emph{Military Technical Academy}, Bucharest\\[0pt]
\end{tabular}
\end{center}
\subsection*{Programming Languages}
\label{sec:orgc05c1cc}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Proficient & C/C++, Go, \emph{Clojure}\\[0pt]
Competent & Scheme, Common Lisp, Bash, Python, Java, JavaScript\\[0pt]
Beginner & Rust, SQL, PowerShell, Perl, Elixir, Erlang\\[0pt]
\end{tabular}
\end{center}
\subsection*{Tools \& Libraries}
\label{sec:org93d3d55}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Proficient & Linux, \emph{Emacs}, Coreutils, Vim, Git, CMake, Org, Tmux\\[0pt]
Competent & \LaTeX{}, Docker, Make, ZeroMQ, Hugo, Leiningen, Babashka, Guix\\[0pt]
Beginner & HTML/CSS, Django, React, Maven, PlantUML, Terraform, RabbitMQ\\[0pt]
\end{tabular}
\end{center}
\subsection*{Languages}
\label{sec:org7ef6245}
\begin{center}
\begin{tabular}{{p{2.5cm}|p{13cm}}}
Native & Romanian\\[0pt]
Expert & English\\[0pt]
Intermediate & Italian\\[0pt]
Beginner & French\\[0pt]
\end{tabular}
\end{center}
\end{document}
